Code/app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments"
---
  def show
    if session[:username] == nil
      redirect_to signin_users_path
    end

    case request.method_symbol
    when :get
      @appointments = Appointment.all

INSERT INTO "appointments" ("timeslot", "user_tele", "user_email", "appt_date", "user_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def add
    if session[:username] == nil
      redirect_to signin_users_path
      return
    end

    case request.method_symbol
    when :get
      return

    when :post
      puts params

      new_appointmt = appointment_params
      new_appointmt[:appt_date] = Date.new(new_appointmt["appt_date(1i)"].to_i,
					new_appointmt["appt_date(2i)"].to_i,
					new_appointmt["appt_date(3i)"].to_i)
      new_appointmt[:user_name] = session[:username]
      @appointmt = Appointment.create!(new_appointmt.except(:appointment_date, :phone, :email))

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT 1  [["id", 23]]
UPDATE "appointments" SET "appt_date" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["appt_date", "2021-12-05"], ["updated_at", "2020-11-24 02:01:44.891071"], ["id", 23]]
---
  def edit
    if session[:username] == nil
      redirect_to signin_users_path
    end

    case request.method_symbol
    when :get
      return
    when :post
      new_appointmt = appointment_params
            @appointmt = Appointment.find_by(id: params[:id])
      if(@appointmt.user_name != session[:username] && session[:usertype] != 1)
        redirect_to appointments_path
        return
      end

      if(new_appointmt["appt_date(1i)"] != nil)
        new_appointmt[:appt_date] = Date.new(new_appointmt["appt_date(1i)"].to_i,
					new_appointmt["appt_date(2i)"].to_i,
					new_appointmt["appt_date(3i)"].to_i)
        @appointmt.update_attributes!(appt_date: new_appointmt[:appt_date])

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 5]]
---
  def drop
    if session[:username] == nil
      redirect_to signin_users_path
      return
    end

    @appointmt = Appointment.find_by(id: params[:id])
    if(@appointmt.user_name == session[:username] || session[:usertype] == 1)
      Appointment.destroy(params[:id])