Code/app/controllers/product_controller.rb

  def search
    @product = Product.all
    @pics = Picture.all
---
SELECT "products".* FROM "products"
SELECT "pictures".* FROM "pictures"