Code/app/controllers/product_controller.rb

  def show
    case request.method_symbol
    when :get
      @products = Product.all
---
SELECT "products".* FROM "products" WHERE (productName LIKE '%new name%')

  def pic
    pic = Picture.find_by(id: params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", 1]]

  def add
    case request.method_symbol
    when :get
      return
    when :post
      new_product = product_params
      unless params.require(:product)[:image].blank?
         @picture = Picture.new
         @picture.data = params.require(:product)[:image].read
         @picture.pic_type = params.require(:product)[:image].content_type
         @picture.filename = params.require(:product)[:image].original_filename
         @picture.save
---
INSERT INTO "pictures" ("data", "pic_type", "filename", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["data", "<18255 bytes of binary data>"], ["pic_type", "image/png"], ["filename", "tmp1.png"], ["created_at", "2020-10-28 06:35:50.075297"], ["updated_at", "2020-10-28 06:35:50.075297"]]
INSERT INTO "products" ("productName", "description", "price", "pics") VALUES ($1, $2, $3, $4) RETURNING "id"  [["productName", "new name"], ["description", "new desc"], ["price", "30"], ["pics", "1"]]

  def edit
    puts session[:username]
    puts session[:usertype]
#    if session[:usertype] == 1
    if true
      case request.method_symbol
      when :get
        return
      when :post
        new_product = product_params
        if params.require(:product)[:image] != nil
          @picture = Picture.new
          @picture.data = params.require(:product)[:image].read
          @picture.pic_type = params.require(:product)[:image].content_type
          @picture.filename = params.require(:product)[:image].original_filename
          @picture.save
          new_product[:pictures] = @picture.id
        end

        @product = Product.find_by(productName: new_product[:product_name])
        if(new_product[:description] != nil && new_product[:description].length >= 3)
          @product.update_attributes!(description: new_product[:description])
---
INSERT INTO "pictures" ("data", "pic_type", "filename", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["data", "<18255 bytes of binary data>"], ["pic_type", "image/png"], ["filename", "tmp1.png"], ["created_at", "2020-10-29 22:52:23.248710"], ["updated_at", "2020-10-29 22:52:23.248710"]]
SELECT  "products".* FROM "products" WHERE "products"."productName" = $1 LIMIT 1  [["productName", "new name"]]
UPDATE "products" SET "description" = $1 WHERE "products"."id" = $2  [["description", "ddd"], ["id", 72]]