Code/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def signin_show
    # signin homepage
    @users= User.all

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 AND "users"."password" = $2 LIMIT 1  [["username", "ec2-user"], ["password", "rikka"]]
---
  def signin
    # sign in
    @user = User.find_by(username: params.require(:user)[:username], password: params.require(:user)[:password])

SELECT "users".* FROM "users"
---
  def signup_show
    # signup homepage
    @users= User.all

INSERT INTO "users" ("email", "username", "password", "lastname", "firstname", "user_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "myemail@tamu.edu"], ["username", "myuser"], ["password", "mypass"], ["lastname", "mylast"], ["firstname", "myfirst"], ["user_type", 0]]
---
  def signup
    # sign up
    new_user = user_params.except(:security_code)
    if params[:security_code] == "rikka"
      new_user[:user_type] = 1
    else
      new_user[:user_type] = 0
    end

    begin
      @user = User.create!(new_user)